{
    "title": "Banana Cream Cheesecake",
    "ingredients": [
        "1 ¼ cups vanilla wafer crumbs",
        "½ cup ground walnuts",
        "5 tablespoons butter, melted",
        "4 (8 ounce) packages cream cheese, room temperature",
        "1 ⅛ cups white sugar",
        "3 tablespoons all-purpose flour",
        "4 eggs",
        "1 cup sour cream",
        "2 ripe bananas, mashed",
        "¼ cup banana liqueur",
        "1 ½ teaspoons vanilla extract",
        "1 ½ teaspoons unflavored gelatin",
        "3 tablespoons cold water",
        "1 cup milk",
        "⅓ cup white sugar",
        "4 egg yolks",
        "2 teaspoons vanilla extract",
        "1 ½ cups heavy cream, chilled",
        "12 vanilla wafer cookies"
    ],
    "core_ingredients": [
        "vanilla wafer crumbs",
        "walnuts",
        "butter",
        "cream cheese",
        "white sugar",
        "flour",
        "eggs",
        "sour cream",
        "bananas",
        "banana liqueur",
        "vanilla extract",
        "gelatin",
        "milk",
        "egg yolks",
        "heavy cream"
    ],
    "instructions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease the sides of a 9-inch springform pan. In a medium bowl, mix together vanilla wafer crumbs, ground walnuts, and melted butter. Press into the bottom of the prepared pan.\n\n2. In a large bowl, stir cream cheese to soften. Mix together 1 1/8 cup sugar and flour; stir into cream cheese until smooth. Stir in eggs, one at a time, mixing until well blended after each one. Stir in sour cream, mashed banana, banana liqueur, and 1 1/2 teaspoons of vanilla. Pour over crust in the springform pan.\n\n3. Cover the bottom of the outside of the cheesecake pan with aluminum foil to prevent water from the water bath from seeping in. Place springform pan inside a larger pan. Place the whole thing into the preheated oven, and fill the outer pan with hot water.\n\n4. Bake for 45 minutes in the preheated oven. After the time is up, turn the oven off, but leave door closed. Leave cheesecake in the unopened oven for 1 hour. Before removing from water bath, run a knife around the outer edge of cake to keep it from shrinking away from the center and cracking. Let cool to room temperature, then refrigerate until chilled, at least 3 hours, or overnight.\n\n5. While cheesecake is baking, sprinkle unflavored gelatin over cold water in a small bowl, and set aside to soften. Heat milk in a small saucepan over medium-low heat until hot but not boiling. Whisk together 1/3 cup sugar and egg yolks until smooth and frothy. Whisk about 1/3 of hot milk into egg yolk mixture, then pour yolk mixture into the pan with remaining milk. Cook over low heat, constantly stirring with a spatula, making sure that the mixture does not burn on the bottom until it is thick enough to coat the back of a metal spoon. Remove from heat. Stir softened gelatin into hot pastry cream until dissolved, then stir in vanilla. Pour into a bowl, place a sheet of plastic wrap directly on the surface, and refrigerate until cooled, about 1 hour.\n\n6. When pastry cream is cooled, whip heavy cream just past soft peaks. Stir pastry cream to soften, then fold in whipped cream. Place vanilla wafers on top of the cooled cheesecake, then spread vanilla cream over entire top. Chill until serving. Run a wet knife around the outer edge of the cake before removing the sides for a cleaner look.",
    "tags": [
        "dessert",
        "cheesecake",
        "banana"
    ],
    "diet_type": "Non-Vegetarian",
    "cuisine": "American",
    "time_to_eat": 320,
    "suggestion_links": [
        "https://www.allrecipes.com/recipe/228315/banana-peanut-butter-cheesecake-aka-the-elvis/",
        "https://www.allrecipes.com/recipe/270371/banana-cheesecake-with-banana-cream-pie-topping/",
        "https://www.allrecipes.com/recipe/270370/bananas-foster-cheesecake/",
        "https://www.allrecipes.com/recipe/259586/cheesecake-factory-banana-cheesecake-with-homemade-whipped-cream/",
        "https://www.allrecipes.com/recipe/47119/banana-cheesecake-with-caramel-sauce/"
    ],
    "img_links": [
        "https://www.allrecipes.com/thmb/WEl9P-sHs1k87KEjVPAm9ST3ys0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4039411-bdd1c94456774795949678cf8a54a953.jpg"
    ],
    "source_url": "https://www.allrecipes.com/recipe/68713/banana-cream-cheesecake/",
    "id": "79d483a9-0695-4d38-ac0c-c54856d08f11"
}