{
    "title": "Vegan Mars Bar Cheesecake",
    "ingredients": [
        "cashews",
        "cream of coconut",
        "brown sugar",
        "salt",
        "almonds",
        "pitted dates",
        "coconut oil",
        "dark chocolate",
        "instant coffee granules",
        "boiling water",
        "silken tofu",
        "white sugar",
        "unsweetened cocoa powder",
        "vanilla extract",
        "dark chocolate"
    ],
    "core_ingredients": [
        "cashews",
        "dark chocolate",
        "silken tofu"
    ],
    "instructions": "1. Soak cashews in enough water to cover for 2 to 3 hours. 2. Bring coconut cream, brown sugar, and salt for caramel sauce to a boil in a saucepan; reduce heat and let simmer until slightly thick, about 5 minutes. Transfer to the refrigerator; it will get thicker as it cools. 3. Blend almonds, dates, and coconut oil together in the bowl of a food processor or an electric blender. Scoop out and pat down into a springform pan. Place into the freezer while you make the filling. 4. Blend 2/3 cup caramel sauce and soaked cashews together in a blender for caramel filling; pour on top of the cake base. Place back into the freezer. 5. Place dark chocolate for chocolate filling in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes. Dissolve coffee in boiling water. Transfer chocolate, coffee mixture, tofu, sugar, cocoa, and vanilla extract to a blender. Blend until smooth; pour onto cake. Return to the freezer. 6. Place dark chocolate for topping in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes. Pour over the cake. 7. Place cake back into the freezer until frozen, about 2 hours. Remove and let defrost for 5 to 10 minutes before cutting.",
    "tags": [
        "cheesecake",
        "dessert",
        "vegan"
    ],
    "diet_type": "Vegan",
    "cuisine": "Desserts",
    "time_to_eat": 295,
    "suggestion_links": [
        "https://www.allrecipes.com/recipe/246514/banana-chocolate-creamed-cashew-cake/",
        "https://www.allrecipes.com/recipe/256014/chai-spice-cheesecake/",
        "https://www.allrecipes.com/recipe/25983/chocolate-almond-marble-cheesecake/",
        "https://www.allrecipes.com/recipe/7714/chocolate-turtles-cheesecake/",
        "https://www.allrecipes.com/recipe/148882/orange-chocolate-twist-cheesecake/"
    ],
    "img_links": [
        "https://www.allrecipes.com/thmb/FpNQt4JMhHr9_qlLdYq-6Xum5Uw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9118021-8ea4e758474f4d7b9a345538ef206419.jpg"
    ],
    "source_url": "https://www.allrecipes.com/recipe/265985/vegan-mars-bar-cheesecake/",
    "id": "aea55ca2-3fef-4791-807d-277affc71e6e"
}